snlkuharlocal/src/DataProcessors/РаспределениеРКМ_РНК_МЧЗ/РаспределениеРКМ_РНК_МЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеРКМ_РНК_МЧЗ</name>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаявкаНаВозвратОтПокупателя/ЗаявкаНаВозвратОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаВозвратОтПокупателя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПокупателя</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоставщика</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПриемки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаявкиНаВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСогласования_Покупатель</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСогласования_Поставщик</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена_Поставщик</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена_Покупатель_ЦО</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена_Покупатель_ТЦ</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/РаспределениеРКМ_РНК_МЧЗ/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика  
	Если НЕ ЗначениеЗаполнено(Объект.ДокОбъект) Тогда
		ВызватьИсключение("Обработка может быть открыта только из Списка документов!");
	КонецЕсли;
	Если ПоХКМЗНВ(Объект.ДокОбъект) Тогда
			
		Элементы.Группа6.ТекущаяСтраница = Элементы.Группа7; 
		Элементы.Группа8.Видимость = Ложь; 
		ОбновитьНаСервере1();
		//Элементы.Группа1.ТекущаяСтраница = Элементы.Группа2;
		//ОбновитьНаСервере();
	Иначе
		Элементы.Группа7.Видимость = Ложь;
		Элементы.Группа6.ТекущаяСтраница = Элементы.Группа8;
		Элементы.Группа1.ТекущаяСтраница = Элементы.Группа2;
		ОбновитьНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоХКМЗНВ(ЗНВ)
	Рез = Ложь;  
	Запр = Новый Запрос;
	Запр.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	|ГДЕ
	|	ХранилищеКодовМаркировки.ДокОснование = &ЗНВ";
	Запр.УстановитьПараметр("ЗНВ", ЗНВ);
	Выб = Запр.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Рез = Истина;
	КонецЕсли;	
	Возврат Рез;
КонецФункции	

&НаСервере
Процедура ОбновитьНаСервере()
	// Вставить содержимое обработчика.  
	ДатаЗНВ = Объект.ДокОбъект.Дата;
	ДатаНач = НачалоДня(ДатаЗНВ - (86400 * 365));
	ДатаКон = КонецДня(ДатаЗНВ);
	ТЗДок.Очистить();
	Запр = Новый Запрос;
	Запр.Текст = 
	"
	//"ВЫБРАТЬ
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	//|	СУММА(ЗаявкаНаВозвратОтПокупателяТовары.Количество) КАК КолвоВозврат,
	//|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК ДокументОтгрузки
	//|	ПОМЕСТИТЬ ВТ_ДрВозв
	//|ИЗ
	//|	Документ.ЗаявкаНаВозвратОтПокупателя.Товары КАК ЗаявкаНаВозвратОтПокупателяТовары
	//| ГДЕ
	//|	НЕ ЗаявкаНаВозвратОтПокупателяТовары.Ссылка = &Ссылка
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Проведен
	//|	СГРУППИРОВАТЬ ПО
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура,
	//|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки
	//|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Количество КАК КолвоВозврат,
	|	isnull(ХранилищеКодовМаркировкиТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ,
	|	isnull(ХранилищеКодовМаркировкиТовары1.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ1,
	|	isnull(РасходнаяНакладнаяТовары.Количество, 0) КАК КолвоРНК,
	|	isnull(РасходнаяНакладнаяТовары.Цена, 0) КАК ЦенаРНК,
	|	РасходнаяНакладнаяТовары.Ссылка.Дата КАК ДатаОт,
	|	isnull(РасходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК РНК,
	|	isnull(ПриходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК ПНК,
	|	isnull(ПриходнаяНакладнаяТовары.Количество, 0) КАК КолвоПНК,
	|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК РНКПодобран,
	//|	isnull(ШтрихкодыУпаковокТоваров.Ссылка, """") КАК ШКУпаковки,
	
	//|	isnull(ВТ_ДрВозв.КолвоВозврат, 0) КАК КолвоВозвратДрРНК,
	
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Контрагент КАК Контрагент1,                                
	
	|	isnull(РекламационнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РекламационнаяНакладная.ПустаяСсылка)) КАК РКМ,
	|	isnull(РекламационнаяНакладнаяТовары.Ссылка.ДокументВозврата, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК РКМ_ПНК,
	|	isnull(РекламационнаяНакладнаяТовары.Количество, 0) КАК КолвоРКМ,  
	
	|	ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки КАК НПП
	|ИЗ
	|	Документ.ЗаявкаНаВозвратОтПокупателя.Товары КАК ЗаявкаНаВозвратОтПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ПО (ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Договор = РасходнаяНакладнаяТовары.Ссылка.Договор
	|	И РасходнаяНакладнаяТовары.Ссылка.Контрагент = ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Контрагент
	|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура
	|	И isnull(РасходнаяНакладнаяТовары.Количество, 0) > 0 
	|	И РасходнаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон)
	|	ИЛИ (РасходнаяНакладнаяТовары.Ссылка = ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки
	|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|		ПО ПриходнаяНакладнаяТовары.Ссылка.ДокОснование = &Ссылка 
	//|		ПО ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Договор = ПриходнаяНакладнаяТовары.Ссылка.Договор
	//|	И ПриходнаяНакладнаяТовары.Ссылка.Контрагент = ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Контрагент
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ПриходнаяНакладнаяТовары.Номенклатура
	//|	И ПриходнаяНакладнаяТовары.Ссылка.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
	//|	И НАЧАЛОПЕРИОДА(ПриходнаяНакладнаяТовары.Ссылка.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Дата, ДЕНЬ)
	//НАЧАЛОПЕРИОДА(&Начало, ДЕНЬ)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары
	|			ПО РасходнаяНакладнаяТовары.Ссылка = ХранилищеКодовМаркировкиТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары1
	|			ПО ПриходнаяНакладнаяТовары.Ссылка = ХранилищеКодовМаркировкиТовары1.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура
	
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	//|		ПО ХранилищеКодовМаркировкиТовары.Ссылка = ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка 
	
	//ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	//|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ШтрихкодыУпаковокТоваров.Владелец
	
	//|			И ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора = ШтрихкодыУпаковокТоваров.Ссылка
	//|			И ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки = ШтрихкодыУпаковокТоваров.Ссылка
	
	//| ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДрВозв КАК ВТ_ДрВозв	
	//| ПО ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ВТ_ДрВозв.Номенклатура
	//|	И РасходнаяНакладнаяТовары.Ссылка = ВТ_ДрВозв.ДокументОтгрузки
	//|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК ДокументОтгрузки
	//|	ПОМЕСТИТЬ ВТ_ДрВозв
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РекламационнаяНакладнаяТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РекламационнаяНакладнаяТовары.Номенклатура
	
	| ГДЕ
	|	ЗаявкаНаВозвратОтПокупателяТовары.Ссылка = &Ссылка
	|	УПОРЯДОЧИТЬ ПО ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки,
	|	РасходнаяНакладнаяТовары.Ссылка.Дата УБЫВ
	|";
	Запр.УстановитьПараметр("Ссылка", Объект.ДокОбъект);
	Запр.УстановитьПараметр("ДатаНач", ДатаНач);
	Запр.УстановитьПараметр("ДатаКон", ДатаКон);
	Выб = Запр.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		НовСтр = ТЗДок.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выб);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере1()
	// Вставить содержимое обработчика.  

	ТЗДок2.Очистить();
	Запр = Новый Запрос;
	Запр.Текст = 
	
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки КАК НПП,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Количество КАК КолвоВозврат,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Единица КАК Единица,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Коэффициент КАК Коэффициент,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Цена КАК Цена,
	|	isnull(РНКТовары.Цена, 0) КАК ЦенаРНК,
	|	isnull(РНКТовары.Количество, 0) КАК КолвоРНК,
	|	isnull(ПНКТовары.Количество, 0) КАК КолвоПНК,
    //|   ХКМШК.ШтрихкодУпаковки КАК ШКУпаковки,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Сумма КАК Сумма,
	|	ЗаявкаНаВозвратОтПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявкаНаВозвратОтПокупателяТовары.НДС КАК НДС,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Всего КАК Всего,
	|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК РНК,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Заявка КАК Заявка,
	|	ЗаявкаНаВозвратОтПокупателяТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка, 
	|	isnull(РекламационнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РекламационнаяНакладная.ПустаяСсылка)) КАК РКМ,
	|	ХКМ.Ссылка КАК ХКМ,
	|	isnull(ПНКТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК ПНК,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Брак КАК Брак
	|ИЗ
	|	Документ.ЗаявкаНаВозвратОтПокупателя.Товары КАК ЗаявкаНаВозвратОтПокупателяТовары
	
	|	СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХКМ
	|   ПО ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Ссылка = ХКМ.Ссылка.ДокОснование
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХКМШК.ШтрихкодУпаковки.Владелец
	
	//|	СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХКМШК
	//|   ПО ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Ссылка = ХКМШК.Ссылка.ДокОснование
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХКМШК.ШтрихкодУпаковки.Владелец
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
	|			ПО ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки = РекламационнаяНакладнаяТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РекламационнаяНакладнаяТовары.Номенклатура
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Ссылка = РекламационнаяНакладнаяТовары.Ссылка.ЗаявкаНаВозвратОтПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РНКТовары
	|			ПО ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки = РНКТовары.Ссылка
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РНКТовары.Номенклатура 
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК ПНКТовары
	|			ПО ЗаявкаНаВозвратОтПокупателяТовары.ССылка = ПНКТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ПНКТовары.Номенклатура
	
	|ГДЕ
	|	ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Ссылка = &Ссылка
	|	УПОРЯДОЧИТЬ ПО 1
	|";
	Запр.УстановитьПараметр("Ссылка", Объект.ДокОбъект);
	//Запр.УстановитьПараметр("ДатаНач", ДатаНач);
	//Запр.УстановитьПараметр("ДатаКон", ДатаКон);
	Выб = Запр.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		НовСтр = ТЗДок2.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выб);
	КонецЦикла;
	
	
	
	//"
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Количество КАК КолвоВозврат,
	//|	isnull(ХранилищеКодовМаркировкиТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ,
	//|	isnull(ХранилищеКодовМаркировкиТовары1.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ1,
	//|	isnull(РасходнаяНакладнаяТовары.Количество, 0) КАК КолвоРНК,
	//|	isnull(РасходнаяНакладнаяТовары.Цена, 0) КАК ЦенаРНК,
	//|	РасходнаяНакладнаяТовары.Ссылка.Дата КАК ДатаОт,
	//|	isnull(РасходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК РНК,
	//|	isnull(ПриходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК ПНК,
	//|	isnull(ПриходнаяНакладнаяТовары.Количество, 0) КАК КолвоПНК,
	//|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК РНКПодобран,
	//|	isnull(РекламационнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РекламационнаяНакладная.ПустаяСсылка)) КАК РКМ,
	//|	isnull(РекламационнаяНакладнаяТовары.Ссылка.ДокументВозврата, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК РКМ_ПНК,
	//|	isnull(РекламационнаяНакладнаяТовары.Количество, 0) КАК КолвоРКМ,  
	//
	//|	ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки КАК НПП
	//|ИЗ
	//|	Документ.ЗаявкаНаВозвратОтПокупателя.Товары КАК ЗаявкаНаВозвратОтПокупателяТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	//|		ПО (ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Договор = РасходнаяНакладнаяТовары.Ссылка.Договор
	//|	И РасходнаяНакладнаяТовары.Ссылка.Контрагент = ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Контрагент
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура
	//|	И isnull(РасходнаяНакладнаяТовары.Количество, 0) > 0 
	//|	И РасходнаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон)
	//|	ИЛИ (РасходнаяНакладнаяТовары.Ссылка = ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки
	//|	И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	//|		ПО ПриходнаяНакладнаяТовары.Ссылка.ДокОснование = &Ссылка 
	////|		ПО ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Договор = ПриходнаяНакладнаяТовары.Ссылка.Договор
	////|	И ПриходнаяНакладнаяТовары.Ссылка.Контрагент = ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Контрагент
	//|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ПриходнаяНакладнаяТовары.Номенклатура
	////|	И ПриходнаяНакладнаяТовары.Ссылка.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
	////|	И НАЧАЛОПЕРИОДА(ПриходнаяНакладнаяТовары.Ссылка.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(ЗаявкаНаВозвратОтПокупателяТовары.Ссылка.Дата, ДЕНЬ)
	////НАЧАЛОПЕРИОДА(&Начало, ДЕНЬ)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары
	//|			ПО РасходнаяНакладнаяТовары.Ссылка = ХранилищеКодовМаркировкиТовары.Ссылка.ДокОснование
	//|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура
	//
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары1
	//|			ПО ПриходнаяНакладнаяТовары.Ссылка = ХранилищеКодовМаркировкиТовары1.Ссылка.ДокОснование
	//|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура
	//
	////|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	////|		ПО ХранилищеКодовМаркировкиТовары.Ссылка = ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка 
	//
	////ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	////|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	////|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	////|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ШтрихкодыУпаковокТоваров.Владелец
	//
	////|			И ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора = ШтрихкодыУпаковокТоваров.Ссылка
	////|			И ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки = ШтрихкодыУпаковокТоваров.Ссылка
	//
	////| ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДрВозв КАК ВТ_ДрВозв	
	////| ПО ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ВТ_ДрВозв.Номенклатура
	////|	И РасходнаяНакладнаяТовары.Ссылка = ВТ_ДрВозв.ДокументОтгрузки
	////|	ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки КАК ДокументОтгрузки
	////|	ПОМЕСТИТЬ ВТ_ДрВозв
	//
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
	//|			ПО РасходнаяНакладнаяТовары.Ссылка = РекламационнаяНакладнаяТовары.Ссылка.ДокОснование
	//|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РекламационнаяНакладнаяТовары.Номенклатура
	//
	//| ГДЕ
	//|	ЗаявкаНаВозвратОтПокупателяТовары.Ссылка = &Ссылка
	//|	УПОРЯДОЧИТЬ ПО ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки,
	//|	РасходнаяНакладнаяТовары.Ссылка.Дата УБЫВ
	//|";
		
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Функция СкорректироватьРаспределениеНаСервере()
	// Вставить содержимое обработчика.
	ОтветС = Новый Структура ("Мод, Сооб", Ложь, "Распределение не выполнено");	
	//ОтветС = "Распределение выполнено";
	ТЗРКМ = ТЗДок.Выгрузить();
	ТЗРКМ.Свернуть("РКМ");
	Для Каждого ТСтр Из ТЗРКМ Цикл
		Если ЗначениеЗаполнено(ТСтр.РКМ) Тогда
			ОтветС.Сооб = "Уже есть привязанные РКМ, распределение невозможно";
			Возврат ОтветС;
		КонецЕсли;	
	КонецЦикла;
	ДокВ = Объект.ДокОбъект.ПолучитьОбъект();
	Для Каждого ТТов Из ДокВ.Товары Цикл
		НПП = ТТов.НомерСтроки;
		Найды = ТЗДок.НайтиСтроки(Новый Структура("НПП", НПП));
		
		Если Найды.Количество() Тогда
			Если НЕ ТТов.ДокументОтгрузки = Найды[0].РНК ИЛИ НЕ ЗначениеЗаполнено(Найды[0].РНКПодобран) Тогда
				ОтветС.Мод = Истина;
				ТТов.ДокументОтгрузки = Найды[0].РНК;
				ТТов.Цена = Найды[0].ЦенаРНК;
				ТТов.Всего = ТТов.Цена * ТТов.Количество;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	ОтветС.Сооб = "Распределение выполнено";
	ДокВ.Записать();
	Возврат ОтветС;
КонецФункции

&НаКлиенте
Процедура СкорректироватьРаспределение(Команда)
	Элементы.Группа1.ТекущаяСтраница = Элементы.Группа2;
	Отв = СкорректироватьРаспределениеНаСервере();
	Если Отв.Мод = Истина Тогда
		ОбновитьНаСервере();
	КонецЕсли;	
	ПоказатьПредупреждение(, Отв.Сооб, 20);
КонецПроцедуры

&НаСервере
Процедура СоздатьРекламацииНаСервере()
	// Вставить содержимое обработчика.  
	ДатаЗНВ = Объект.ДокОбъект.Дата;
	ТЗДок1.Очистить();
	РНКРКМ.Очистить();
	Запр = Новый Запрос;
	Запр.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаВозвратОтПокупателяТовары.Количество КАК КолвоВозврат,
	|	ЕСТЬNULL(ХранилищеКодовМаркировкиТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ,
	|	ЕСТЬNULL(ХранилищеКодовМаркировкиТовары1.Ссылка, ЗНАЧЕНИЕ(Документ.ХранилищеКодовМаркировки.ПустаяСсылка)) КАК ХКМ1,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Количество, 0) КАК КолвоРНК,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Цена, 0) КАК ЦенаРНК,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК РНК,
	|	ЕСТЬNULL(ПриходнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК ПНК,
	|	ЕСТЬNULL(ПриходнаяНакладнаяТовары.Количество, 0) КАК КолвоПНК,
	|	ЕСТЬNULL(РекламационнаяНакладнаяТовары.Ссылка, ЗНАЧЕНИЕ(Документ.РекламационнаяНакладная.ПустаяСсылка)) КАК РКМ,
	|	ЕСТЬNULL(РекламационнаяНакладнаяТовары.Ссылка.ДокументВозврата, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК РКМ_ПНК,
	|	ЕСТЬNULL(РекламационнаяНакладнаяТовары.Количество, 0) КАК КолвоРКМ,
	|	ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки КАК НПП,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Единица, ЗНАЧЕНИЕ(Справочник.Единицы.ПустаяССылка)) КАК Единица,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.ЦенаБезСкидки, 0) КАК ЦенаБезСкидки,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(РасходнаяНакладнаяТовары.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)) КАК СтавкаНДС
	|ИЗ
	|	Документ.ЗаявкаНаВозвратОтПокупателя.Товары КАК ЗаявкаНаВозвратОтПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ПО (РасходнаяНакладнаяТовары.Ссылка = ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки)
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|		ПО (ПриходнаяНакладнаяТовары.Ссылка.ДокОснование = &Ссылка)
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ПриходнаяНакладнаяТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары
	|		ПО ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки = ХранилищеКодовМаркировкиТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.Товары КАК ХранилищеКодовМаркировкиТовары1
	|		ПО (ПриходнаяНакладнаяТовары.Ссылка = ХранилищеКодовМаркировкиТовары1.Ссылка.ДокОснование)
	|			И (ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = ХранилищеКодовМаркировкиТовары.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
	|		ПО ЗаявкаНаВозвратОтПокупателяТовары.ДокументОтгрузки.Ссылка = РекламационнаяНакладнаяТовары.Ссылка.ДокОснование
	|			И ЗаявкаНаВозвратОтПокупателяТовары.Номенклатура = РекламационнаяНакладнаяТовары.Номенклатура
	|ГДЕ
	|	ЗаявкаНаВозвратОтПокупателяТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаВозвратОтПокупателяТовары.НомерСтроки";
	Запр.УстановитьПараметр("Ссылка", Объект.ДокОбъект);
	//Запр.УстановитьПараметр("ДатаНач", ДатаНач);
	//Запр.УстановитьПараметр("ДатаКон", ДатаКон);
	Выб = Запр.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		НовСтр = ТЗДок1.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выб);
	КонецЦикла; 
	ТЗС = ТЗДок1.Выгрузить();
	ТЗС.Свернуть("РНК"); 
	ТЗС1 = ТЗДок1.Выгрузить();
	ТЗС1.Свернуть("ПНК, РНК"); 
	ТЗС2 = ТЗДок1.Выгрузить();
	ТЗС2.Свернуть("РНК, РКМ"); 
	СоотДок = Новый Соответствие;
	
	Для Каждого ТекСтр Из ТЗС Цикл
		
			
		НовСтр = РНКРКМ.Добавить();
		НовСтр.РНК = ТекСтр.РНК;
		Найды1 = ТЗС2.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
		ТекРКМ = Неопределено;
		Для Каждого Найд1 Из Найды1 Цикл
			Если ЗначениеЗаполнено(Найд1.РКМ) Тогда
				ТекРКМ = Найд1.РКМ;
				НовСтр.РКМ = ТекРКМ;
			КонецЕсли;	
		КонецЦикла;	
		Если ТекРКМ = Неопределено Тогда
			ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
			ДокРКМ.ИБ = ПолучитьИБПоУмолчанию(); 
			Найды = ТЗС1.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
			ТД = ТекущаяДатаСеанса();
			Если Найды.Количество() Тогда 
				Если Месяц(Найды[0].ПНК.Дата) = Месяц(ТД) Тогда
					ДокРКМ.Дата = Найды[0].ПНК.Дата;
				Иначе
    				ДокРКМ.Дата = ТекущаяДатаСеанса();
				КонецЕсли;
			Иначе
				ДокРКМ.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			ДокРКМ.ДокОснование = ТекСтр.РНК;
			ДокРКМ.Валюта = ТекСтр.РНК.Валюта;
			РКМОбработкаЗаполнения(ТекСтр.РНК, ДокРКМ);
			ДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат;
			ДокРКМ.ЗаявкаНаВозвратОтПокупателя = Объект.ДокОбъект.Ссылка;
			УстановитьНомерДокументаКлиентСервер(ДокРКМ);
			ДокРКМ.Записать();
			НовСтр.РКМ = ДокРКМ.Ссылка; 
			НовСтр.НовыйРКМ = Истина;
		КонецЕсли;
		СоотДок.Вставить(НовСтр.РНК, НовСтр.РКМ);
	КонецЦикла; 
	Для Каждого КлЗ Из СоотДок Цикл
		ТРНК = КлЗ.Ключ;
		ТРКМ = КлЗ.Значение;  
		ДокРКМ = ТРКМ.ПолучитьОбъект();
		Если 1=2 Тогда
			ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
		КонецЕсли;
		Найды = ТЗДок1.НайтиСтроки(Новый Структура("РНК", ТРНК));
		Если Найды.Количество() Тогда
			Если НЕ ЗначениеЗаполнено(Найды[0].РКМ) И ЗначениеЗаполнено(Найды[0].ПНК) И НЕ ЗначениеЗаполнено(ДокРКМ.ДокументВозврата) Тогда
				ДокРКМ.ДокументВозврата = Найды[0].ПНК;
			КонецЕсли;	
		КонецЕсли;	
		Для Каждого Найд Из Найды Цикл
			Если НЕ ЗначениеЗаполнено(Найд.РКМ) Тогда
				НовС = ДокРКМ.Товары.Добавить();
				НовС.Номенклатура = Найд.Номенклатура;
				НовС.КоличествоИсх = Найд.КолвоРНК;
				НовС.КоличествоФакт = Найд.КолвоРНК - Найд.КолвоВозврат;
				НовС.Количество = Найд.КолвоВозврат;
				НовС.Единица = Найд.Единица;
				НовС.Коэффициент = Найд.Коэффициент;
				НовС.Цена = Найд.Цена;
				НовС.ЦенаБезСкидки = Найд.ЦенаБезСкидки;
				НовС.СтавкаНДС = Найд.СтавкаНДС; 
				НовС.Объем = Окр(Найд.Объем * Найд.КолвоВозврат/Найд.КолвоРНК, 3);
				НовС.Всего = НовС.Цена * НовС.Количество;
				НовС.ВсегоБезСкидки = НовС.ЦенаБезСкидки * НовС.Количество;
				
				ПСтавкаНДС=ПроцентНДСпоСтавке(НовС.СтавкаНДС);
				НовС.НДС = Окр(НовС.Всего*ПСтавкаНДС/(1+ПСтавкаНДС),2);
				НовС.Сумма = НовС.Всего - НовС.НДС;
				
				Найд.РКМ = ТРКМ;
				Найд.РКМ_ПНК = ДокРКМ.ДокументВозврата;
			КонецЕсли;	
		КонецЦикла;	
		ДокРКМ.Записать();
	КонецЦикла;	
	
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Единица, ЗНАЧЕНИЕ(Справочник.Единицы.ПустаяССылка)) КАК Единица,
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Цена, 0) КАК Цена,
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.ЦенаБезСкидки, 0) КАК ЦенаБезСкидки,
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Коэффициент, 1) КАК Коэффициент,
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.Объем, 0) КАК Объем,
	//|	ЕСТЬNULL(РасходнаяНакладнаяТовары.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)) КАК СтавкаНДС
	
	//ТекРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
	//			//крохин начало 12.02.2020
	//			ТекРКМ.ИБ = ПолучитьИБПоУмолчанию();
	//			//крохин конец 12.02.2020
	//			ТекРКМ.ДокОснование = СтрокаТЧ.РНК;
	//			ТекРКМ.Валюта = СтрокаТЧ.РНК.валюта;
	//			РКМОбработкаЗаполнения(СтрокаТЧ.РНК,ТекРКМ);
	//			ТекРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат;
	//			//крохин начало 30.08.2019
	//			Если ЗначениеНеЗаполнено(ДатаКСФ) Тогда
	//				ТекРКМ.Дата = ПНКОбъект.Дата;
	//			Иначе
	//				ТекРКМ.Дата = НачалоДня(ДатаКСФ)+(ПНКОбъект.Дата - НачалоДня(ПНКОбъект.Дата));
	//			КонецЕсли;
	//			//крохин конец 30.08.2019
	//			
	//			//крохин начало 13.06.2022
	//			//для ТЦ франчайзи надо заполнять ЗНВ
	//			Если ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
	//				ДокОснование = ДокОбъект.ДокОснование;
	//				Если ДокОснование <> Неопределено И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратОтПокупателя") Тогда
	//					ТекРКМ.ЗаявкаНаВозвратОтПокупателя = ДокОснование;
	//				КонецЕсли;
	//			ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ЗаявкаНаВозвратОтПокупателя") Тогда
	//				ТекРКМ.ЗаявкаНаВозвратОтПокупателя = ДокОбъект;
	//			КонецЕсли;
	//			//крохин конец 13.06.2022
	//			
	//			УстановитьНомерДокумента(ТекРКМ);
   //ДатаКСФ = ВыбПНКСсылка.Дата;
   // //крохин начало 07.05.2021
   // //иногда не хватает даты, а для налоговой важен только квартал документа
   // //НачПериодаРаспределения = ДатаКСФ - 3*365*24*60*60;
   // НачПериодаРаспределения = НачалоКвартала(ДатаКСФ - 3*365*24*60*60);
   // //крохин конец 07.05.2021
   // 
   // /// Шворобей ВЮ 13.12.2022 ++
   // КонПериодаРаспределения = ?(ЕстьРеквизитДокумента("ДатаВходящихДокументов", ВыбПНКСсылка.Метаданные()), ВыбПНКСсылка.ДатаВходящихДокументов,
   // 	ВыбПНКСсылка.Дата);
   // /// Шворобей ВЮ 13.12.2022 ++
   // 
   // Если ЗначениеНеЗаполнено(КонПериодаРаспределения) Тогда
   // 	КонПериодаРаспределения = ДатаКСФ;
   // КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРекламации(Команда) 
	Элементы.Группа1.ТекущаяСтраница = Элементы.Группа3;
	СоздатьРекламацииНаСервере();
КонецПроцедуры

Процедура РКМОбработкаЗаполнения(Основание,РКМ) 	
	
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	РКМ.ДокОснование	= Основание;
	
	//Нечаева 15,01,14  +++
	Если ВидОснования="Перемещение" Тогда 
		Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= РКМ.ДокОснование.Дата Тогда
			//ВидРекламации=Перечисления.ВидыРекламаций.Вычерк 
			Сообщить("Не возможно создание Вычерка на основании документа Перемещение");
			мСозданиеНевозможно=Истина;
		КонецЕсли;
	КонецЕсли;
	//Нечаева 15,01,14  ---
	
	//Нечаева09.12.14  +++ по письму Колобкова. К ним только Претензии.
	Если ВидОснования="ПриходнаяНакладная" Тогда 
		Сообщить("Не возможно создание РКМ на основании документа ПНК. Можно создавать только Претензию.");
		мСозданиеНевозможно=Истина;
		
	КонецЕсли;
	//Нечаева 09.12.14  ---
	
	
	
	
	// Катаев+ 19/03/13  Добавил заполнение на основании акта приемки
	Если ВидОснования = "АктПриемки" Тогда
		Если РКМ.ДокОснование.РНК.Пустая() Тогда
			Сообщить("В акте приемки отсутствует РНК. Создание документа запрещено");
			мСозданиеНевозможно=Истина;
			Возврат;
		Конецесли;
		РКМ.ПунктДоставки	= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ПунктДоставки");			
		РКМ.Менеджер 		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Менеджер");			
		РКМ.Организация		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Организация");	
		РКМ.ТипЦен			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипЦен");
		РКМ.ТипСкидок		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипСкидок");
		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Скидка");
		//12.03.14 нечаева - цены слетают --
	Иначе
		РКМ.ПунктДоставки	= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ПунктДоставки");			
		РКМ.Менеджер 		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Менеджер");			
		РКМ.Организация		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Организация");	
		РКМ.ТипЦен			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипЦен");
		РКМ.ТипСкидок		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипСкидок");
		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
		//12.03.14 нечаева - цены слетают --
	КонецЕсли;
	// Катаев- 19/03/13 
	
	//крохин начало 29.01.2013
	//менеджер, для отчета "продажи"
	РКМ.Менеджер			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Менеджер");
	//крохин конец 29.01.2013
	
	РКМ.Комментарий		= ""+РКМ.ДокОснование.Метаданные()+" № " + РКМ.ДокОснование.Номер + " от " + Формат(РКМ.ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.Контрагент;		
		РКМ.Склад			= РКМ.ДокОснование.Склад;
		//крохин начало 06.03.2012
		РКМ.ВидОплаты = РКМ.ДокОснование.ВидОплаты;
		//крохин конец 06.03.2012
		//крохин начало 24.05.2012
		РКМ.ДатаОплаты = РКМ.Докоснование.ДатаОплаты;
		//крохин конец 24.05.2012
	ИначеЕсли ВидОснования="Перемещение" Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.СкладПолучатель;
		РКМ.Склад			= РКМ.ДокОснование.Склад;
		// Катаев+ 19/03/13 
	ИначеЕсли Видоснования="АктПриемки"	 Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.Контрагент;		
		РКМ.Склад			= РКМ.ДокОснование.Склад;
		РКМ.ДатаОплаты = РКМ.ДокОснование.РНК.ДатаОплаты;
		//Катаев- 19/03/13
	Иначе
		РКМ.Склад			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Склад");		
	КонецЕсли;	
	
	РКМ.договор = ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Договор");
	
	////Если ВидОснования="ПриходнаяНакладная" И ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
	////	Поставщику=Истина;
	////	
	////	Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
	////		Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
	////			СтрокаТЧ=Товары.Добавить();
	////			ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
	////			
	////			СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
	////			СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
	////			СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоИсх;				
	////			
	////			РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
	////		КонецЕсли; 			
	////	КонецЦикла;
	////ИначеЕсли ВидОснования="Перемещение" Тогда
	////	Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
	////		Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
	////			СтрокаТЧ=Товары.Добавить();
	////			ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
	////			
	////			СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
	////			СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
	////			СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
	////			
	////			РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
	////		КонецЕсли;
	////	КонецЦикла;
	////КонецЕсли; 
	//крохин начало 20.11.2011
	////Если ВидОснования="РасходнаяНакладная" И КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= РКМ.ДокОснование.Дата Тогда
	////	ВидРекламации = Перечисления.ВидыРекламаций.Вычерк;
	////Иначе
	////	ВидРекламации = Перечисления.ВидыРекламаций.Рекламация;
	////КонецЕсли;
	//крохин конец 20.11.2011
	
	
	//Катаев+ 19/03/13 Заполнение ТЧ на основании АктаПриемки и РНК
	
	
	// нечаева 24,02,016 убрала рнк из заполнения, не правильно считает нач. остаток, если несколько вычерков
	//Если ВидОснования="РасходнаяНакладная" Или ВидОснования="АктПриемки" Тогда // было
	////Если  ВидОснования="АктПриемки" Тогда
	////	Если ВидОснования = "АктПриемки" Тогда
	////		РНК = ДокОснование.РНК;
	////		ДокОснование = ДокОснование.РНК;
	////	Иначе
	////		РНК =ДокОснование;
	////	КонецЕсли;
	////	Запрос = новый Запрос;
	////	Запрос.Текст =
	////	"ВЫБРАТЬ
	////	|	РасхожденияПоАктуОстатки.Номенклатура,
	////	|	РасхожденияПоАктуОстатки.ОтправленоОстаток,
	////	|	РасхожденияПоАктуОстатки.ПринятоОстаток
	////	|ИЗ
	////	|	РегистрНакопления.РасхожденияПоАкту.Остатки(, РНК = &РНК) КАК РасхожденияПоАктуОстатки";
	////	Запрос.УстановитьПараметр("РНК", РНК);
	////	Выборка = запрос.Выполнить().Выбрать();
	////	Пока Выборка.Следующий() Цикл
	////		СтрокаТЧ=Товары.Добавить();
	////		СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
	////		СтрокаТЧ.КоличествоИсх = Выборка.ОтправленоОстаток;
	////		СтрокаТЧ.КоличествоФакт = Выборка.ПринятоОстаток;
	////		СтрокаТЧ.Количество	= СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
	////	КонецЦикла;
	////КонецЕсли;
	
	//Катаев- 19/03/13
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура НайтиСоздатьРКМНаСервере()
	// Вставить содержимое обработчика.   
	//ТЗНом = ТЗДок2.Выгрузить();
	//ТЗНом1 = ТЗНом.Скопировать();
	//МРНК = Новый Массив;
	
	ТЗС = ТЗДок2.Выгрузить();
	ТЗС1 = ТЗДок2.Выгрузить();
	ТЗС1.Свернуть("РНК, РКМ, ПНК");
	МРНК = ТЗС1.ВыгрузитьКолонку("РНК");
	Запр = Новый Запрос;
	Запр.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Ссылка КАК Ссылка,
	|	РасходнаяНакладнаяТовары.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяТовары.Количество КАК Количество,
	|	РасходнаяНакладнаяТовары.Единица КАК Единица,
	|	РасходнаяНакладнаяТовары.Коэффициент КАК Коэффициент,
	|	РасходнаяНакладнаяТовары.ЦенаБезСкидки КАК ЦенаБезСкидки,
	|	РасходнаяНакладнаяТовары.Цена КАК Цена,
	|	РасходнаяНакладнаяТовары.Сумма КАК Сумма,
	|	РасходнаяНакладнаяТовары.Объем КАК Объем,
	|	РасходнаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяТовары.НДС КАК НДС,
	|	РасходнаяНакладнаяТовары.Всего КАК Всего,
	|	РасходнаяНакладнаяТовары.ВсегоБезСкидки КАК ВсегоБезСкидки,
	|	РасходнаяНакладнаяТовары.Скидка КАК Скидка,
	|	РасходнаяНакладнаяТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка,
	|	РасходнаяНакладнаяТовары.Заявка КАК Заявка,
	|	РасходнаяНакладнаяТовары.ТипЦен КАК ТипЦен,
	|	РасходнаяНакладнаяТовары.ЦенаПосредника КАК ЦенаПосредника,
	|	РасходнаяНакладнаяТовары.ЦенаБезБонуса КАК ЦенаБезБонуса,
	|	РасходнаяНакладнаяТовары.ВсегоБезБонуса КАК ВсегоБезБонуса,
	|	РасходнаяНакладнаяТовары.Акция КАК Акция,
	|	РасходнаяНакладнаяТовары.КоличествоКомплектующих КАК КоличествоКомплектующих,
	|	РасходнаяНакладнаяТовары.ТребуетсяМаркировка КАК ТребуетсяМаркировка
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка В(&МРНК)";
	Запр.УстановитьПараметр("МРНК", МРНК);
	ТЗНом = Запр.Выполнить().Выгрузить();
	Запр.Текст =
	"ВЫБРАТЬ
	|	ХКМЗНВ.Ссылка.ДокОснование КАК ЗНВ,
	|	ХКМРНК.Ссылка.ДокОснование КАК РНК,
	|	ХКМЗНВ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ХКМЗНВ.ШтрихкодУпаковки.Владелец КАК Номенклатура
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХКМЗНВ
	|	СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХКМРНК
	|	ПО ХКМЗНВ.ШтрихкодУпаковки = ХКМРНК.ШтрихкодУпаковки
	|ГДЕ
	|	ХКМЗНВ.Ссылка.ДокОснование = &ДокОснование
	|	И ХКМРНК.Ссылка.ДокОснование В(&МРНК)
	|	";
	Запр.УстановитьПараметр("ДокОснование", Объект.ДокОбъект);
	Запр.УстановитьПараметр("МРНК", МРНК); 
	ТЗШК = Запр.Выполнить().Выгрузить();
	Для Каждого ТекСтр Из ТЗС1 Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтр.РКМ) Тогда
			ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
			ДокРКМ.ИБ = ПолучитьИБПоУмолчанию(); 
			Найды = ТЗС1.НайтиСтроки(Новый Структура("РНК", ТекСтр.РНК));
			ТД = ТекущаяДатаСеанса();
			ДокРКМ.Дата = ТекущаяДатаСеанса();
			ДокРКМ.ДокОснование = ТекСтр.РНК;
			ДокРКМ.Валюта = ТекСтр.РНК.Валюта;
			РКМОбработкаЗаполнения(ТекСтр.РНК, ДокРКМ);
			ДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат;
			ДокРКМ.ЗаявкаНаВозвратОтПокупателя = Объект.ДокОбъект.Ссылка; 
			ДокРКМ.ДокументВозврата = ТекСтр.ПНК;
			УстановитьНомерДокументаКлиентСервер(ДокРКМ); 
			Найды = ТЗС.НайтиСтроки(Новый Структура("РНК", ТекСтр.РНК));
			Для Каждого Найд Из Найды Цикл	
				НовС = ДокРКМ.Товары.Добавить();
				НовС.Номенклатура = Найд.Номенклатура;
				НовС.КоличествоИсх = Найд.КолвоРНК;
				НовС.КоличествоФакт = Найд.КолвоРНК - Найд.КолвоВозврат;
				НовС.Количество = Найд.КолвоВозврат;
				НовС.Единица = Найд.Единица;
				НовС.Коэффициент = Найд.Коэффициент;
				НовС.Цена = Найд.Цена;
				НовС.ЦенаБезСкидки = Найд.ЦенаБезСкидки;
				НовС.СтавкаНДС = Найд.СтавкаНДС; 
				//НовС.Объем = Окр(Найд.Объем * Найд.КолвоВозврат/Найд.КолвоРНК, 3);
				НовС.Всего = НовС.Цена * НовС.Количество;
				НовС.ВсегоБезСкидки = НовС.ЦенаБезСкидки * НовС.Количество;
				
				ПСтавкаНДС=ПроцентНДСпоСтавке(НовС.СтавкаНДС);
				НовС.НДС = Окр(НовС.Всего*ПСтавкаНДС/(1+ПСтавкаНДС),2);
				НовС.Сумма = НовС.Всего - НовС.НДС; 
				НайдыШК = ТЗШК.НайтиСтроки(Новый Структура("РНК, ЗНВ, Номенклатура", ТекСтр.РНК, Объект.ДокОбъект, НовС.Номенклатура));
				Если НайдыШК.Количество() Тогда
					н = 0;
					Пока (н < НайдыШК.Количество()) И (н < НовС.Количество) Цикл
						НовШК = ДокРКМ.ШтрихкодыУпаковок.Добавить();
						НовШК.Товар = НайдыШК[н].Номенклатура;
						НовШК.ШтрихкодУпаковки = НайдыШК[н].ШтрихкодУпаковки;
						НовШК.ШКМаркиКонтрагента = НайдыШК[н].ШтрихкодУпаковки.Наименование;
						НовШК.Количество = 1;
						н = н + 1;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			ДокРКМ.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
	
	
	//ТЗС1 = ТЗДок1.Выгрузить();
	//ТЗС1.Свернуть("ПНК, РНК"); 
	//ТЗС2 = ТЗДок1.Выгрузить();
	//ТЗС2.Свернуть("РНК, РКМ"); 
	//СоотДок = Новый Соответствие;
	//
	//Для Каждого ТекСтр Из ТЗС Цикл
	//	
	//		
	//	НовСтр = РНКРКМ.Добавить();
	//	НовСтр.РНК = ТекСтр.РНК;
	//	Найды1 = ТЗС2.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
	//	ТекРКМ = Неопределено;
	//	Для Каждого Найд1 Из Найды1 Цикл
	//		Если ЗначениеЗаполнено(Найд1.РКМ) Тогда
	//			ТекРКМ = Найд1.РКМ;
	//			НовСтр.РКМ = ТекРКМ;
	//		КонецЕсли;	
	//	КонецЦикла;	
	//	Если ТекРКМ = Неопределено Тогда
	//		ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
	//		ДокРКМ.ИБ = ПолучитьИБПоУмолчанию(); 
	//		Найды = ТЗС1.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
	//		ТД = ТекущаяДатаСеанса();
	//		Если Найды.Количество() Тогда 
	//			Если Месяц(Найды[0].ПНК.Дата) = Месяц(ТД) Тогда
	//				ДокРКМ.Дата = Найды[0].ПНК.Дата;
	//			Иначе
	//				ДокРКМ.Дата = ТекущаяДатаСеанса();
	//			КонецЕсли;
	//		Иначе
	//			ДокРКМ.Дата = ТекущаяДатаСеанса();
	//		КонецЕсли;
	//		ДокРКМ.ДокОснование = ТекСтр.РНК;
	//		ДокРКМ.Валюта = ТекСтр.РНК.Валюта;
	//		РКМОбработкаЗаполнения(ТекСтр.РНК, ДокРКМ);
	//		ДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат;
	//		ДокРКМ.ЗаявкаНаВозвратОтПокупателя = Объект.ДокОбъект.Ссылка;
	//		УстановитьНомерДокументаКлиентСервер(ДокРКМ);
	//		ДокРКМ.Записать();
	//		НовСтр.РКМ = ДокРКМ.Ссылка; 
	//		НовСтр.НовыйРКМ = Истина;
	//	КонецЕсли;
	//	СоотДок.Вставить(НовСтр.РНК, НовСтр.РКМ);
	//КонецЦикла; 
	//Для Каждого КлЗ Из СоотДок Цикл
	//	ТРНК = КлЗ.Ключ;
	//	ТРКМ = КлЗ.Значение;  
	//	ДокРКМ = ТРКМ.ПолучитьОбъект();
	//	Если 1=2 Тогда
	//		ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
	//	КонецЕсли;
	//	Найды = ТЗДок1.НайтиСтроки(Новый Структура("РНК", ТРНК));
	//	Если Найды.Количество() Тогда
	//		Если НЕ ЗначениеЗаполнено(Найды[0].РКМ) И ЗначениеЗаполнено(Найды[0].ПНК) И НЕ ЗначениеЗаполнено(ДокРКМ.ДокументВозврата) Тогда
	//			ДокРКМ.ДокументВозврата = Найды[0].ПНК;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//	Для Каждого Найд Из Найды Цикл
	//		Если НЕ ЗначениеЗаполнено(Найд.РКМ) Тогда
	//			НовС = ДокРКМ.Товары.Добавить();
	//			НовС.Номенклатура = Найд.Номенклатура;
	//			НовС.КоличествоИсх = Найд.КолвоРНК;
	//			НовС.КоличествоФакт = Найд.КолвоРНК - Найд.КолвоВозврат;
	//			НовС.Количество = Найд.КолвоВозврат;
	//			НовС.Единица = Найд.Единица;
	//			НовС.Коэффициент = Найд.Коэффициент;
	//			НовС.Цена = Найд.Цена;
	//			НовС.ЦенаБезСкидки = Найд.ЦенаБезСкидки;
	//			НовС.СтавкаНДС = Найд.СтавкаНДС; 
	//			НовС.Объем = Окр(Найд.Объем * Найд.КолвоВозврат/Найд.КолвоРНК, 3);
	//			НовС.Всего = НовС.Цена * НовС.Количество;
	//			НовС.ВсегоБезСкидки = НовС.ЦенаБезСкидки * НовС.Количество;
	//			
	//			ПСтавкаНДС=ПроцентНДСпоСтавке(НовС.СтавкаНДС);
	//			НовС.НДС = Окр(НовС.Всего*ПСтавкаНДС/(1+ПСтавкаНДС),2);
	//			НовС.Сумма = НовС.Всего - НовС.НДС;
	//			
	//			Найд.РКМ = ТРКМ;
	//			Найд.РКМ_ПНК = ДокРКМ.ДокументВозврата;
	//		КонецЕсли;	
	//	КонецЦикла;	
	//	ДокРКМ.Записать();
	//КонецЦикла;
	
	
	ОбновитьНаСервере1();
КонецПроцедуры

&НаКлиенте
Процедура НайтиСоздатьРКМ(Команда)
	НайтиСоздатьРКМНаСервере();
КонецПроцедуры
